In [33]:
print("Hello MK's Data Analysis era")

Hello MK's Data Analysis era

In [34]:
import numpy as np
import pandas as pd

arr = np.array([1,2,3,4])
print(arr.mean())

df = pd.DataFrame({"Marks": [85,90,67]})
df

2.5

   Marks
0     85
1     90
2     67

# NumPy & Pandas Practice 101

## Objective
Practice basic operations using NumPy and Pandas on a small dataset.

In [35]:
import pandas as pd
import numpy as np

In [36]:
df = pd.read_csv('C:/Users/hp/Downloads/indian_employee.csv')

In [37]:
df.head(10)

,Emp_ID,Name,Age,Salary (INR),Experience (Years),City,Department,Performance Rating
0,101,Amit Sharma,27,650000.0,4.0,Delhi,IT,4.5
1,102,Riya Gupta,32,NaN,8.0,Mumbai,HR,3.8
2,103,Rajesh Verma,45,120000000.0,NaN,Bangalore,Finance,4.9
3,104,Priya Singh,29,720000.0,6.0,Kolkata,IT,4.2
4,105,Sunil Kumar,26,500000.0,3.0,Chennai,Sales,NaN
5,106,Alok Mehta,52,2000000.0,28.0,Hyderabad,Operations,5.0
6,107,Kavita Yadav,31,inf,10.0,Pune,IT,4.0
7,108,Pankaj Mishra,24,-45000.0,2.0,Jaipur,Marketing,3.5
8,109,Deepika Reddy,48,30000000.0,30.0,Bangalore,Management,5.0
9,110,Ramesh Patil,29,720000.0,6.0,Kolkata,IT,4.2

## Data Cleaning

In [38]:
#Checking the missing values

In [39]:
print("Missing Values in each column")
df.isnull().sum()

Missing Values in each column

Emp_ID                0
Name                  0
Age                   0
Salary (INR)          2
Experience (Years)    1
City                  0
Department            0
Performance Rating    1
dtype: int64

In [40]:
#Filling NaN values with a calucalated average value

In [41]:
df['Salary (INR)'] = df['Salary (INR)'].fillna(df['Salary (INR)'].mean())

In [42]:
df

,Emp_ID,Name,Age,Salary (INR),Experience (Years),City,Department,Performance Rating
0,101,Amit Sharma,27,650000.0,4.0,Delhi,IT,4.5
1,102,Riya Gupta,32,inf,8.0,Mumbai,HR,3.8
2,103,Rajesh Verma,45,120000000.0,NaN,Bangalore,Finance,4.9
3,104,Priya Singh,29,720000.0,6.0,Kolkata,IT,4.2
4,105,Sunil Kumar,26,500000.0,3.0,Chennai,Sales,NaN
5,106,Alok Mehta,52,2000000.0,28.0,Hyderabad,Operations,5.0
6,107,Kavita Yadav,31,inf,10.0,Pune,IT,4.0
7,108,Pankaj Mishra,24,-45000.0,2.0,Jaipur,Marketing,3.5
8,109,Deepika Reddy,48,30000000.0,30.0,Bangalore,Management,5.0
9,110,Ramesh Patil,29,720000.0,6.0,Kolkata,IT,4.2
10,111,Meera Nair,34,820000.0,9.0,Kochi,HR,4.3
11,112,Sameer Desai,37,11000000.0,15.0,Delhi,Finance,4.8
12,113,Swati Joshi,29,650000.0,5.0,Mumbai,IT,4.6
13,114,Vinod Iyer,55,5000000.0,35.0,Chennai,Management,5.0
14,115,Anjali Saxena,23,380000.0,1.0,Pune,HR,3.9
15,116,Manish Khanna,40,1250000.0,18.0,Hyderabad,Operations,4.7
16,117,Arjun Pandey,31,750000.0,7.0,Jaipur,IT,4.4
17,118,Neha Kapoor,28,inf,4.0,Bangalore,IT,3.8
18,119,Amit Sharma,27,650000.0,4.0,Delhi,IT,4.5
19,120,Rohit Bhansal,36,980000.0,12.0,Mumbai,Finance,3.6
20,121,Suresh Choudhary,42,inf,20.0,Hyderabad,Operations,4.9
21,122,Sneha Tiwari,25,550000.0,2.0,Kolkata,Sales,4.1
22,123,Gopal Das,51,4800000.0,32.0,Kochi,Management,3.2
23,124,Preeti Sharma,33,770000.0,8.0,Pune,HR,4.5
24,125,Aditya Saxena,22,-30000.0,0.0,Delhi,IT,3.3
25,126,Kiran Kumar,29,650000.0,5.0,Mumbai,IT,2.6
26,127,Mohan Reddy,30,820000.0,7.0,Bangalore,HR,4.4

In [43]:
df['Experience (Years)'] = df['Experience (Years)'].fillna(df['Experience (Years)'].median())
df['Performance Rating'] = df['Performance Rating'].fillna(df['Performance Rating'].median())

In [44]:
df

,Emp_ID,Name,Age,Salary (INR),Experience (Years),City,Department,Performance Rating
0,101,Amit Sharma,27,650000.0,4.0,Delhi,IT,4.50
1,102,Riya Gupta,32,inf,8.0,Mumbai,HR,3.80
2,103,Rajesh Verma,45,120000000.0,7.0,Bangalore,Finance,4.90
3,104,Priya Singh,29,720000.0,6.0,Kolkata,IT,4.20
4,105,Sunil Kumar,26,500000.0,3.0,Chennai,Sales,4.35
5,106,Alok Mehta,52,2000000.0,28.0,Hyderabad,Operations,5.00
6,107,Kavita Yadav,31,inf,10.0,Pune,IT,4.00
7,108,Pankaj Mishra,24,-45000.0,2.0,Jaipur,Marketing,3.50
8,109,Deepika Reddy,48,30000000.0,30.0,Bangalore,Management,5.00
9,110,Ramesh Patil,29,720000.0,6.0,Kolkata,IT,4.20
10,111,Meera Nair,34,820000.0,9.0,Kochi,HR,4.30
11,112,Sameer Desai,37,11000000.0,15.0,Delhi,Finance,4.80
12,113,Swati Joshi,29,650000.0,5.0,Mumbai,IT,4.60
13,114,Vinod Iyer,55,5000000.0,35.0,Chennai,Management,5.00
14,115,Anjali Saxena,23,380000.0,1.0,Pune,HR,3.90
15,116,Manish Khanna,40,1250000.0,18.0,Hyderabad,Operations,4.70
16,117,Arjun Pandey,31,750000.0,7.0,Jaipur,IT,4.40
17,118,Neha Kapoor,28,inf,4.0,Bangalore,IT,3.80
18,119,Amit Sharma,27,650000.0,4.0,Delhi,IT,4.50
19,120,Rohit Bhansal,36,980000.0,12.0,Mumbai,Finance,3.60
20,121,Suresh Choudhary,42,inf,20.0,Hyderabad,Operations,4.90
21,122,Sneha Tiwari,25,550000.0,2.0,Kolkata,Sales,4.10
22,123,Gopal Das,51,4800000.0,32.0,Kochi,Management,3.20
23,124,Preeti Sharma,33,770000.0,8.0,Pune,HR,4.50
24,125,Aditya Saxena,22,-30000.0,0.0,Delhi,IT,3.30
25,126,Kiran Kumar,29,650000.0,5.0,Mumbai,IT,2.60
26,127,Mohan Reddy,30,820000.0,7.0,Bangalore,HR,4.40

In [45]:
df.isnull().sum()

Emp_ID                0
Name                  0
Age                   0
Salary (INR)          0
Experience (Years)    0
City                  0
Department            0
Performance Rating    0
dtype: int64

In [46]:
# Replacing infinite values with NaN values and replacing NaN values with mean

In [47]:
df.replace([np.inf, -np.inf], np.nan, inplace=True)
df['Salary (INR)'] = df['Salary (INR)'].fillna(df['Salary (INR)'].mean())
df

,Emp_ID,Name,Age,Salary (INR),Experience (Years),City,Department,Performance Rating
0,101,Amit Sharma,27,6.500000e+05,4.0,Delhi,IT,4.50
1,102,Riya Gupta,32,7.981957e+06,8.0,Mumbai,HR,3.80
2,103,Rajesh Verma,45,1.200000e+08,7.0,Bangalore,Finance,4.90
3,104,Priya Singh,29,7.200000e+05,6.0,Kolkata,IT,4.20
4,105,Sunil Kumar,26,5.000000e+05,3.0,Chennai,Sales,4.35
5,106,Alok Mehta,52,2.000000e+06,28.0,Hyderabad,Operations,5.00
6,107,Kavita Yadav,31,7.981957e+06,10.0,Pune,IT,4.00
7,108,Pankaj Mishra,24,-4.500000e+04,2.0,Jaipur,Marketing,3.50
8,109,Deepika Reddy,48,3.000000e+07,30.0,Bangalore,Management,5.00
9,110,Ramesh Patil,29,7.200000e+05,6.0,Kolkata,IT,4.20
10,111,Meera Nair,34,8.200000e+05,9.0,Kochi,HR,4.30
11,112,Sameer Desai,37,1.100000e+07,15.0,Delhi,Finance,4.80
12,113,Swati Joshi,29,6.500000e+05,5.0,Mumbai,IT,4.60
13,114,Vinod Iyer,55,5.000000e+06,35.0,Chennai,Management,5.00
14,115,Anjali Saxena,23,3.800000e+05,1.0,Pune,HR,3.90
15,116,Manish Khanna,40,1.250000e+06,18.0,Hyderabad,Operations,4.70
16,117,Arjun Pandey,31,7.500000e+05,7.0,Jaipur,IT,4.40
17,118,Neha Kapoor,28,7.981957e+06,4.0,Bangalore,IT,3.80
18,119,Amit Sharma,27,6.500000e+05,4.0,Delhi,IT,4.50
19,120,Rohit Bhansal,36,9.800000e+05,12.0,Mumbai,Finance,3.60
20,121,Suresh Choudhary,42,7.981957e+06,20.0,Hyderabad,Operations,4.90
21,122,Sneha Tiwari,25,5.500000e+05,2.0,Kolkata,Sales,4.10
22,123,Gopal Das,51,4.800000e+06,32.0,Kochi,Management,3.20
23,124,Preeti Sharma,33,7.700000e+05,8.0,Pune,HR,4.50
24,125,Aditya Saxena,22,-3.000000e+04,0.0,Delhi,IT,3.30
25,126,Kiran Kumar,29,6.500000e+05,5.0,Mumbai,IT,2.60
26,127,Mohan Reddy,30,8.200000e+05,7.0,Bangalore,HR,4.40

In [48]:
# Handling negative values in Salary column

In [49]:
df['Salary (INR)'] = np.where(df['Salary (INR)'] < 0, df['Salary (INR)'].median(), df['Salary (INR)'])

In [50]:
df

,Emp_ID,Name,Age,Salary (INR),Experience (Years),City,Department,Performance Rating
0,101,Amit Sharma,27,6.500000e+05,4.0,Delhi,IT,4.50
1,102,Riya Gupta,32,7.981957e+06,8.0,Mumbai,HR,3.80
2,103,Rajesh Verma,45,1.200000e+08,7.0,Bangalore,Finance,4.90
3,104,Priya Singh,29,7.200000e+05,6.0,Kolkata,IT,4.20
4,105,Sunil Kumar,26,5.000000e+05,3.0,Chennai,Sales,4.35
5,106,Alok Mehta,52,2.000000e+06,28.0,Hyderabad,Operations,5.00
6,107,Kavita Yadav,31,7.981957e+06,10.0,Pune,IT,4.00
7,108,Pankaj Mishra,24,8.200000e+05,2.0,Jaipur,Marketing,3.50
8,109,Deepika Reddy,48,3.000000e+07,30.0,Bangalore,Management,5.00
9,110,Ramesh Patil,29,7.200000e+05,6.0,Kolkata,IT,4.20
10,111,Meera Nair,34,8.200000e+05,9.0,Kochi,HR,4.30
11,112,Sameer Desai,37,1.100000e+07,15.0,Delhi,Finance,4.80
12,113,Swati Joshi,29,6.500000e+05,5.0,Mumbai,IT,4.60
13,114,Vinod Iyer,55,5.000000e+06,35.0,Chennai,Management,5.00
14,115,Anjali Saxena,23,3.800000e+05,1.0,Pune,HR,3.90
15,116,Manish Khanna,40,1.250000e+06,18.0,Hyderabad,Operations,4.70
16,117,Arjun Pandey,31,7.500000e+05,7.0,Jaipur,IT,4.40
17,118,Neha Kapoor,28,7.981957e+06,4.0,Bangalore,IT,3.80
18,119,Amit Sharma,27,6.500000e+05,4.0,Delhi,IT,4.50
19,120,Rohit Bhansal,36,9.800000e+05,12.0,Mumbai,Finance,3.60
20,121,Suresh Choudhary,42,7.981957e+06,20.0,Hyderabad,Operations,4.90
21,122,Sneha Tiwari,25,5.500000e+05,2.0,Kolkata,Sales,4.10
22,123,Gopal Das,51,4.800000e+06,32.0,Kochi,Management,3.20
23,124,Preeti Sharma,33,7.700000e+05,8.0,Pune,HR,4.50
24,125,Aditya Saxena,22,8.200000e+05,0.0,Delhi,IT,3.30
25,126,Kiran Kumar,29,6.500000e+05,5.0,Mumbai,IT,2.60
26,127,Mohan Reddy,30,8.200000e+05,7.0,Bangalore,HR,4.40

In [51]:
# Converting salary column to int from float
df['Salary (INR)'] = df['Salary (INR)'].round().astype('Int64')

In [75]:
# Handling outliers in salary column although the dataset is extremely right-skewed

In [53]:
salary_mean = df['Salary (INR)'].mean()
salary_std = df['Salary (INR)'].std()
lower_bound = salary_mean - (3 * salary_std)
upper_bound = salary_mean + (2 * salary_std)

In [54]:
df = df[(df['Salary (INR)'] >= lower_bound) & (df['Salary (INR)'] <= upper_bound)]

In [55]:
df

,Emp_ID,Name,Age,Salary (INR),Experience (Years),City,Department,Performance Rating
0,101,Amit Sharma,27,650000,4.0,Delhi,IT,4.50
1,102,Riya Gupta,32,7981957,8.0,Mumbai,HR,3.80
3,104,Priya Singh,29,720000,6.0,Kolkata,IT,4.20
4,105,Sunil Kumar,26,500000,3.0,Chennai,Sales,4.35
5,106,Alok Mehta,52,2000000,28.0,Hyderabad,Operations,5.00
6,107,Kavita Yadav,31,7981957,10.0,Pune,IT,4.00
7,108,Pankaj Mishra,24,820000,2.0,Jaipur,Marketing,3.50
8,109,Deepika Reddy,48,30000000,30.0,Bangalore,Management,5.00
9,110,Ramesh Patil,29,720000,6.0,Kolkata,IT,4.20
10,111,Meera Nair,34,820000,9.0,Kochi,HR,4.30
11,112,Sameer Desai,37,11000000,15.0,Delhi,Finance,4.80
12,113,Swati Joshi,29,650000,5.0,Mumbai,IT,4.60
13,114,Vinod Iyer,55,5000000,35.0,Chennai,Management,5.00
14,115,Anjali Saxena,23,380000,1.0,Pune,HR,3.90
15,116,Manish Khanna,40,1250000,18.0,Hyderabad,Operations,4.70
16,117,Arjun Pandey,31,750000,7.0,Jaipur,IT,4.40
17,118,Neha Kapoor,28,7981957,4.0,Bangalore,IT,3.80
18,119,Amit Sharma,27,650000,4.0,Delhi,IT,4.50
19,120,Rohit Bhansal,36,980000,12.0,Mumbai,Finance,3.60
20,121,Suresh Choudhary,42,7981957,20.0,Hyderabad,Operations,4.90
21,122,Sneha Tiwari,25,550000,2.0,Kolkata,Sales,4.10
22,123,Gopal Das,51,4800000,32.0,Kochi,Management,3.20
23,124,Preeti Sharma,33,770000,8.0,Pune,HR,4.50
24,125,Aditya Saxena,22,820000,0.0,Delhi,IT,3.30
25,126,Kiran Kumar,29,650000,5.0,Mumbai,IT,2.60
26,127,Mohan Reddy,30,820000,7.0,Bangalore,HR,4.40

In [56]:
# Tracks how fast the values rise
df['Salary (INR)'].quantile([0.1, 0.25, 0.5, 0.75, 0.9])

0.10     600000.0
0.25     667500.0
0.50     820000.0
0.75    4950000.0
0.90    7981957.0
Name: Salary (INR), dtype: Float64

## Data Analysis

#### Correlation between Salary and Experience

In [57]:
df[['Salary (INR)', 'Experience (Years)']].corr()

                    Salary (INR)  Experience (Years)
Salary (INR)            1.000000            0.515453
Experience (Years)      0.515453            1.000000

In [58]:
# NOTE: There is a moderately high correlation between the two entities.

In [59]:
df['Exp_Bucket'] = pd.cut(df['Experience (Years)'], bins = [0, 5, 10, 20, 30, 40])

print("Average salary by Exerience Bucket")
df.groupby('Exp_Bucket')['Salary (INR)'].mean()

Average salary by Exerience Bucket

Exp_Bucket
(0, 5]       1425773.0
(5, 10]     2570489.25
(10, 20]    5302989.25
(20, 30]    16000000.0
(30, 40]     4900000.0
Name: Salary (INR), dtype: Float64

In [60]:
# NOTE: The experience bucket of 10-20 has the highest average salary while 0-5 has the lowest.

#### Department-wise salaries

In [61]:
dept_salary = df.groupby('Department')['Salary (INR)']

In [62]:
dept_salary.agg(avg_salary = 'median', min_salary = 'min', max_salary = 'max', count = 'count').sort_values(by='avg_salary', ascending=False)

            avg_salary  min_salary  max_salary  count
Department
Finance      5990000.0      980000    11000000      2
Management   5000000.0     4800000    30000000      3
Operations   2000000.0     1250000     7981957      3
Marketing     820000.0      820000      820000      1
HR            820000.0      380000     7981957      5
IT            720000.0      650000     7981957     10
Sales         525000.0      500000      550000      2

#### Performance Rating vs Salary

In [63]:
df[['Performance Rating', 'Salary (INR)']].corr()

                    Performance Rating  Salary (INR)
Performance Rating            1.000000      0.295734
Salary (INR)                  0.295734      1.000000

In [64]:
# NOTE: There is a really weak correlation between Performace rating and salary so we cannot establish any conclusion using this.

#### City-wise salary variation within departments

In [65]:
df.pivot_table(values='Salary (INR)', index='Department', columns='City', aggfunc='median')

City,Bangalore,Chennai,Delhi,Hyderabad,Jaipur,Kochi,Kolkata,Mumbai,Pune
Department,,,,,,,,,
Finance,<NA>,<NA>,11000000.0,<NA>,<NA>,<NA>,<NA>,980000.0,<NA>
HR,820000.0,<NA>,<NA>,<NA>,<NA>,820000.0,<NA>,7981957.0,575000.0
IT,7981957.0,<NA>,650000.0,<NA>,750000.0,<NA>,720000.0,650000.0,7981957.0
Management,30000000.0,5000000.0,<NA>,<NA>,<NA>,4800000.0,<NA>,<NA>,<NA>
Marketing,<NA>,<NA>,<NA>,<NA>,820000.0,<NA>,<NA>,<NA>,<NA>
Operations,<NA>,<NA>,<NA>,2000000.0,<NA>,<NA>,<NA>,<NA>,<NA>
Sales,<NA>,500000.0,<NA>,<NA>,<NA>,<NA>,550000.0,<NA>,<NA>

In [66]:
# NOTE: From this table, we can conclude that Banglore and Kochi pay the same in HR dept. while Mumbai pays a lot higher. Also, Banglore pays the most to IT dept.

#### Average performance rating of each department

In [67]:
df.groupby('Department')['Performance Rating'].mean().sort_values(ascending=False)

Department
Operations    4.866667
Management    4.400000
Sales         4.225000
Finance       4.200000
HR            4.180000
IT            4.010000
Marketing     3.500000
Name: Performance Rating, dtype: float64

In [68]:
# NOTE: We can see that the Operations dept. has the highest performance rating while Marketing has the lowest.

#### Age Bucket Analysis

In [69]:
df[['Age', 'Performance Rating']].corr()

                         Age  Performance Rating
Age                 1.000000            0.421613
Performance Rating  0.421613            1.000000

In [70]:
# NOTE: We have a moderate correlation between the two entities.

In [71]:
df['Age_Group'] = pd.cut(df['Age'], bins = [20, 30, 40 ,50, 60])

In [72]:
df.groupby('Age_Group')['Performance Rating'].mean().sort_values(ascending=False)

Age_Group
(40, 50]    4.950000
(50, 60]    4.400000
(30, 40]    4.262500
(20, 30]    3.996154
Name: Performance Rating, dtype: float64

In [73]:
# NOTE: We can conclude that the age bucket of 40-50 has the highest performance rating.